/*
 * Been.c
 *
 *  Created on: Mar 10, 2023
 *      Author: linjias
 */
#include "Been.h"
#include "zf_driver_gpio.h"
//==============================================================================
//  @brief      初始化蜂鸣器
//==============================================================================
void Beep_Init(){
     gpio_init(C13, GPO, 0, GPO_PUSH_PULL);
     Beep_set(0);
}
//==============================================================================
//  @brief      蜂鸣器嘤嘤
//==============================================================================
void Beep_set(uint8 Value){
    gpio_set_level (C13,Value );
}

/***************************************************
*                 霍尔传感器初始化
*  类型：公有
*  返回值：无
*  功能：检测入库
***************************************************/
void Car_checkinit()
{
    gpio_init(E5, GPI, GPIO_HIGH, GPI_PULL_UP);                               // 初始化 F5 输入 默认高电平 上拉输入
}

